driver-tests/bpelse/benchmark/JBIBridge/CALoanProcessor/test/LoanProcessorHTTPBC/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loan="http://xml.netbeans.org/examples/LoanApplication">
  <soapenv:Body>
    <loan:autoLoanApplication>
      <loan:loan>new</loan:loan>
      <loan:term>100</loan:term>
      <loan:amount>5000.00</loan:amount>
      <loan:application>individual</loan:application>
      <loan:state>CA</loan:state>
      <!--1 or more repetitions:-->
      <loan:applicant>
        <loan:name>
          <loan:first>John</loan:first>
          <loan:middle>D</loan:middle>
          <loan:last>Doe</loan:last>
          <loan:suffix>III</loan:suffix>
        </loan:name>
        <loan:SSID>123-45-6789</loan:SSID>
        <loan:birthDate>2004-02-14</loan:birthDate>
        <loan:homePhone>
          <loan:areaCode>626</loan:areaCode>
          <loan:exchange>234</loan:exchange>
          <loan:number>1234</loan:number>
          <!--Optional:-->
          <loan:extension>123</loan:extension>
        </loan:homePhone>
        <loan:cellPhone>
          <loan:areaCode>626</loan:areaCode>
          <loan:exchange>234</loan:exchange>
          <loan:number>1234</loan:number>
          <!--Optional:-->
          <loan:extension>123</loan:extension>
        </loan:cellPhone>
        <loan:emailAddress>a@b.com</loan:emailAddress>
        <!--1 or more repetitions:-->
        <loan:residence>
          <loan:address>
            <loan:address1>123 Street</loan:address1>
            <loan:address2>steeet</loan:address2>
            <loan:city>Monrovia</loan:city>
            <loan:state>NY</loan:state>
            <loan:zip>91010</loan:zip>
          </loan:address>
          <loan:occupancy>
            <loan:type>own</loan:type>
            <loan:movedIn>2009-05-16</loan:movedIn>
            <loan:lengthOfOccupancy>
              <loan:years>201</loan:years>
              <loan:months>12</loan:months>
            </loan:lengthOfOccupancy>
            <loan:payment>1000.00</loan:payment>
          </loan:occupancy>
        </loan:residence>
        <loan:employment>
          <loan:status>employed</loan:status>
          <!--Optional:-->
          <loan:detail>
            <loan:occupation>string</loan:occupation>
            <loan:employer>
              <loan:name>string</loan:name>
              <loan:address>
                <loan:address1>string</loan:address1>
                <loan:address2>string</loan:address2>
                <loan:city>?string?</loan:city>
                <loan:state>AZ</loan:state>
                <loan:zip>91710</loan:zip>
              </loan:address>
              <loan:lengthOfEmployment>
                <loan:years>201</loan:years>
                <loan:months>12</loan:months>
              </loan:lengthOfEmployment>
            </loan:employer>
            <loan:workPhone>
              <loan:areaCode>string</loan:areaCode>
              <loan:exchange>string</loan:exchange>
              <loan:number>string</loan:number>
              <!--Optional:-->
              <loan:extension>string</loan:extension>
            </loan:workPhone>
            <loan:grossMonthlyIncome>1000.00</loan:grossMonthlyIncome>
          </loan:detail>
        </loan:employment>
        <loan:supplementalIncome>
          <loan:source>investments</loan:source>
          <loan:grossMonthlyIncome>1000.00</loan:grossMonthlyIncome>
        </loan:supplementalIncome>
      </loan:applicant>
      <!--Zero or more repetitions:-->
      <loan:tradeIn>
        <loan:vehicle>
          <loan:year>2012-07:00</loan:year>
          <loan:make>string</loan:make>
          <loan:model>string</loan:model>
          <loan:VIN>string</loan:VIN>
        </loan:vehicle>
        <loan:monthlyPayment>1000.00</loan:monthlyPayment>
      </loan:tradeIn>
    </loan:autoLoanApplication>
  </soapenv:Body>
</soapenv:Envelope>