driver-tests/bpelse/benchmark/JBIBridge/CALoanProcessor/test/LoanProcessorHTTPBC/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <autoLoanApplication xmlns="http://xml.netbeans.org/examples/LoanApplication" xmlns:jbi="http://java.sun.com/xml/ns/jbi/wsdl-11-wrapper" xmlns:msgns="urn:stc:egate:jce:CAPSProjectLoanProcessor_LoanProcessor" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <loan>new</loan>
      <term>100</term>
      <amount>5000.00</amount>
      <application>individualXSD-OTD</application>
      <state>CA</state>
      <applicant>
        <name>
          <first>John</first>
          <middle>D</middle>
          <last>Doe</last>
          <suffix>III</suffix>
        </name>
        <SSID>123-45-6789</SSID>
        <birthDate>2004-02-14</birthDate>
        <homePhone>
          <areaCode>626</areaCode>
          <exchange>234</exchange>
          <number>1234</number>
          <extension>123</extension>
        </homePhone>
        <cellPhone>
          <areaCode>626</areaCode>
          <exchange>234</exchange>
          <number>1234</number>
          <extension>123</extension>
        </cellPhone>
        <emailAddress>a@b.com</emailAddress>
        <residence>
          <address>
            <address1>123 Street</address1>
            <address2>steeet</address2>
            <city>Monrovia</city>
            <state>NY</state>
            <zip>91010</zip>
          </address>
          <occupancy>
            <type>own</type>
            <movedIn>2009-05-16</movedIn>
            <lengthOfOccupancy>
              <years>201</years>
              <months>12</months>
            </lengthOfOccupancy>
            <payment>1000.00</payment>
          </occupancy>
        </residence>
        <employment>
          <status>employed</status>
          <detail>
            <occupation>string</occupation>
            <employer>
              <name>string</name>
              <address>
                <address1>string</address1>
                <address2>string</address2>
                <city>?string?</city>
                <state>AZ</state>
                <zip>91710</zip>
              </address>
              <lengthOfEmployment>
                <years>201</years>
                <months>12</months>
              </lengthOfEmployment>
            </employer>
            <workPhone>
              <areaCode>string</areaCode>
              <exchange>string</exchange>
              <number>string</number>
              <extension>string</extension>
            </workPhone>
            <grossMonthlyIncome>1000.00</grossMonthlyIncome>
          </detail>
        </employment>
        <supplementalIncome>
          <source>investments</source>
          <grossMonthlyIncome>1000.00</grossMonthlyIncome>
        </supplementalIncome>
      </applicant>
      <tradeIn>
        <vehicle>
          <year>2012-07:00</year>
          <make>string</make>
          <model>string</model>
          <VIN>string</VIN>
        </vehicle>
        <monthlyPayment>1000.00</monthlyPayment>
      </tradeIn>
    </autoLoanApplication>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
