driver-tests/bpelse/benchmark/JBIBridge/CALoanProcessor/test/LoanProcessorFCXEJBPProxy/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <tns:autoLoanApplication xmlns:jbi="http://java.sun.com/xml/ns/jbi/wsdl-11-wrapper" xmlns:msgns="urn:stc:egate:jce:CAPSProjectLoanProcessorFCX_LoanProcessor" xmlns:tns="http://xml.netbeans.org/examples/LoanApplication">
      <tns:loan>new</tns:loan>
      <tns:term>100</tns:term>
      <tns:amount>5000.00</tns:amount>
      <tns:application>individual</tns:application>
      <tns:state>CA</tns:state>
      <tns:applicant>
        <tns:name>
          <tns:first>FCX-OTD</tns:first>
          <tns:middle>D</tns:middle>
          <tns:last>Doe</tns:last>
          <tns:suffix>III</tns:suffix>
        </tns:name>
        <tns:SSID>123-45-6789</tns:SSID>
        <tns:birthDate>2004-02-14</tns:birthDate>
        <tns:homePhone>
          <tns:areaCode>626</tns:areaCode>
          <tns:exchange>234</tns:exchange>
          <tns:number>1234</tns:number>
          <tns:extension>123</tns:extension>
        </tns:homePhone>
        <tns:cellPhone>
          <tns:areaCode>626</tns:areaCode>
          <tns:exchange>234</tns:exchange>
          <tns:number>1234</tns:number>
          <tns:extension>123</tns:extension>
        </tns:cellPhone>
        <tns:emailAddress>a@b.com</tns:emailAddress>
        <tns:residence>
          <tns:address>
            <tns:address1>123 Street</tns:address1>
            <tns:address2>steeet</tns:address2>
            <tns:city>Monrovia</tns:city>
            <tns:state>NY</tns:state>
            <tns:zip>91010</tns:zip>
          </tns:address>
          <tns:occupancy>
            <tns:type>own</tns:type>
            <tns:movedIn>2009-05-16</tns:movedIn>
            <tns:lengthOfOccupancy>
              <tns:years>201</tns:years>
              <tns:months>12</tns:months>
            </tns:lengthOfOccupancy>
            <tns:payment>1000.00</tns:payment>
          </tns:occupancy>
        </tns:residence>
        <tns:employment>
          <tns:status>employed</tns:status>
          <tns:detail>
            <tns:occupation>string</tns:occupation>
            <tns:employer>
              <tns:name>string</tns:name>
              <tns:address>
                <tns:address1>string</tns:address1>
                <tns:address2>string</tns:address2>
                <tns:city>?string?</tns:city>
                <tns:state>AZ</tns:state>
                <tns:zip>91710</tns:zip>
              </tns:address>
              <tns:lengthOfEmployment>
                <tns:years>201</tns:years>
                <tns:months>12</tns:months>
              </tns:lengthOfEmployment>
            </tns:employer>
            <tns:workPhone>
              <tns:areaCode>string</tns:areaCode>
              <tns:exchange>string</tns:exchange>
              <tns:number>string</tns:number>
              <tns:extension>string</tns:extension>
            </tns:workPhone>
            <tns:grossMonthlyIncome>1000.00</tns:grossMonthlyIncome>
          </tns:detail>
        </tns:employment>
        <tns:supplementalIncome>
          <tns:source>investments</tns:source>
          <tns:grossMonthlyIncome>1000.00</tns:grossMonthlyIncome>
        </tns:supplementalIncome>
      </tns:applicant>
      <tns:tradeIn>
        <tns:vehicle>
          <tns:year>2012-07:00</tns:year>
          <tns:make>string</tns:make>
          <tns:model>string</tns:model>
          <tns:VIN>string</tns:VIN>
        </tns:vehicle>
        <tns:monthlyPayment>1000.00</tns:monthlyPayment>
      </tns:tradeIn>
    </tns:autoLoanApplication>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
